import React from 'react';

import imageWoman from '../../assets/images/test-image-profile/woman.png'
import image from '../../assets/images/test-image-posts/children.jpeg'
import styles from './Post.module.scss'

const list = [
    {
        id: 1,
        user: 322334,
        image: image,
        userName: "Наталья",
        timePost: 4,
        title:"Новый лук",
        descreption: "Девочки,всем добрый день Малышу сейчас 6,5 мес, начали прикорм в 5,5, с овощей баночных,вводила продукт 3-4 дня, кушал хорошо, конечно всю банку не съехал после введения,но половину точно.Девочки,всем добрый день Малышу сейчас 6,5 мес, начали прикорм в 5,5, с овощей баночных,вводила продукт 3-4 дня, кушал хорошо, конечно всю банку не съехал после введения,но половину точно."
    }
]

const Post: React.FC = () => {
    return (
        <div className={styles.container}>

            {list.map((item) => (
                <ul key={item.id}>

                    <li className={styles.list}>

                        {/*Фото/Имя/Время пользователя/дополнительная информация о посте*/}
                        <div className={styles.title}>
                            <div className={styles.title_main}>
                                <img src={imageWoman} alt='image' style={{height: "40px"}}/>
                                <div className={styles.title_mainUser}>
                                    <h3>{item.userName}</h3>
                                    <p style={{color: "grey"}}>{item.timePost} минуты назад</p>
                                </div>
                            </div>
                            <div className={styles.title_info}>
                                <svg width="24" height="24" viewBox="0 0 16 16" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M7.125 3.60938C7.125 3.84144 7.21719 4.064 7.38128 4.22809C7.54538 4.39219 7.76794 4.48438 8 4.48438C8.23206 4.48438 8.45462 4.39219 8.61872 4.22809C8.78281 4.064 8.875 3.84144 8.875 3.60938C8.875 3.37731 8.78281 3.15475 8.61872 2.99066C8.45462 2.82656 8.23206 2.73438 8 2.73438C7.76794 2.73438 7.54538 2.82656 7.38128 2.99066C7.21719 3.15475 7.125 3.37731 7.125 3.60938ZM7.125 7.98438C7.125 8.21644 7.21719 8.439 7.38128 8.60309C7.54538 8.76719 7.76794 8.85938 8 8.85938C8.23206 8.85938 8.45462 8.76719 8.61872 8.60309C8.78281 8.439 8.875 8.21644 8.875 7.98438C8.875 7.75231 8.78281 7.52975 8.61872 7.36566C8.45462 7.20156 8.23206 7.10937 8 7.10938C7.76794 7.10937 7.54538 7.20156 7.38128 7.36566C7.21719 7.52975 7.125 7.75231 7.125 7.98438ZM7.125 12.3594C7.125 12.5914 7.21719 12.814 7.38128 12.9781C7.54538 13.1422 7.76794 13.2344 8 13.2344C8.23206 13.2344 8.45462 13.1422 8.61872 12.9781C8.78281 12.814 8.875 12.5914 8.875 12.3594C8.875 12.1273 8.78281 11.9048 8.61872 11.7407C8.45462 11.5766 8.23206 11.4844 8 11.4844C7.76794 11.4844 7.54538 11.5766 7.38128 11.7407C7.21719 11.9048 7.125 12.1273 7.125 12.3594Z" fill="black"/>
                                </svg>
                            </div>
                        </div>

                        {/*Фото прикрепленное пользователем*/}
                        <img src={item.image} alt='image' className={styles.image}/>

                        {/*Название/описание темы*/}
                        <div className={styles.descreption}>
                            <h3>{item.title}</h3>
                            <p>{item.descreption}</p>
                            <p className={styles.descreption_p}>Читать далее...</p>
                        </div>

                        {/*Лайки/Дизлайки/Комменты*/}
                        <div className={styles.utils}>
                            <div className={styles.utils_like}>
                                <svg width="22" height="20" viewBox="0 0 22 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M6.5 1C3.4625 1 1 3.4625 1 6.5C1 12 7.5 17 11 18.163C14.5 17 21 12 21 6.5C21 3.4625 18.5375 1 15.5 1C13.64 1 11.995 1.9235 11 3.337C10.4928 2.61469 9.81897 2.0252 9.03568 1.61841C8.25238 1.21162 7.38263 0.999502 6.5 1Z" stroke="currentColor" />
                                </svg>
                                <p>4</p>
                            </div>
                            <div className={styles.utils_comments}>
                                <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M10 19C11.78 19 13.5201 18.4722 15.0001 17.4832C16.4802 16.4943 17.6337 15.0887 18.3149 13.4442C18.9961 11.7996 19.1743 9.99002 18.8271 8.24419C18.4798 6.49836 17.6226 4.89472 16.364 3.63604C15.1053 2.37737 13.5016 1.5202 11.7558 1.17294C10.01 0.82567 8.20038 1.0039 6.55585 1.68509C4.91131 2.36628 3.50571 3.51983 2.51677 4.99987C1.52784 6.47991 1 8.21997 1 10C1 11.488 1.36 12.891 2 14.127L1 19L5.873 18C7.109 18.64 8.513 19 10 19Z" stroke="currentColor"/>
                                </svg>
                                <p>25</p>
                            </div>
                        </div>

                    </li>

                </ul>
            ))}

        </div>
    );
};

export default Post;